//
// Auto Generated Code
//

// Generate From Matrix.xlsx
module.exports = {
	1: {
		ID: 1,
		Name: '三人阵',
		MatrixPos: {"1":{"x":840, "y":300},"2":{"x":1010, "y":300},"3":{"x":1180, "y":300}},
		Area1: [1],
		Area2: [1,2],
		Area3: [1,2,3]
	},
	2: {
		ID: 2,
		Name: '五人阵',
		MatrixPos: {"1":{"x":100, "y":300},"2":{"x":100, "y":300},"3":{"x":100, "y":300},"4":{"x":100, "y":300},"5":{"x":100, "y":300}},
		Area1: [1,2],
		Area2: [1,2,3,4],
		Area3: [1,2,3,4,5]
	},
	3: {
		ID: 3,
		Name: '主角1',
		MatrixPos: {"1":{"x":330, "y":300}},
		Area1: [1],
		Area2: [1],
		Area3: [1]
	},
	4: {
		ID: 4,
		Name: '主角2',
		MatrixPos: {"1":{"x":430, "y":300},"2":{"x":240, "y":300}},
		Area1: [1],
		Area2: [1,2],
		Area3: [1,2]
	},
	5: {
		ID: 5,
		Name: '主角3',
		MatrixPos: {"1":{"x":520, "y":300},"2":{"x":330, "y":300},"3":{"x":140, "y":300}},
		Area1: [1],
		Area2: [1,2],
		Area3: [1,2,3]
	},
};
